// Написать программу, вычисляющую стоимость купленных яблок, если известен их вес и цена за кг.
// 编写一个计算所购苹果成本的程序，如果已知其重量和每公斤价格。

// Формат ввода  输入格式
// Два числа через пробел: цена яблок за 1 кг. в рублях, вес яблок в килограммах.
// 两个数字通过空格分隔：苹果每公斤的价格（卢布），苹果的重量（公斤）。

// Формат вывода  输出格式
// Одно число: стоимость яблок в рублях
// 一个数字：苹果的成本（卢布）

// https://github.com/buonfu/programming101.git


#include <stdio.h>

int main()
{
    double pp, w;
    double p;

    scanf("%lf %lf", &pp, &w);

    p = pp * w;

    printf("%.6f", p);

    return 0;
}