// Дано целое пятизначное число. Определить, сколько цифр в нем четные.
// 给定一个五位数。确定其中有多少个偶数数字。

// Формат ввода  输入格式
// Одно целое пятизначное число
// 一个五位数

// Формат вывода  输出格式
// Одно целое число, равное количеству чётных цифр
// 一个等于偶数数字个数的整数

// Пример 1  示例 1
// Ввод 10000
// Вывод 4

// Пример 2  示例 2
// Ввод 23456
// Вывод 3

// Пример 3  示例 3
// Ввод 12134
// Вывод 2

// https://github.com/buonfu/programming101.git

#include <stdio.h>

int main() 
{
    int i, n;
    int cnt = 0;
    int nd = 0;

    scanf("%d", &n);

    for (i = 0; i < 5; i++) {
        int nd = n % 10;
        if (nd % 2 == 0) {
            cnt++;
        }
        n = n / 10;
    }

    printf("%d", cnt);

    return 0;
}
