// Написать программу, которая проверяет, делится ли на три введенное с клавиатуры целое число.
// 编写一个程序，检查从键盘输入的整数是否能被 3 整除。

// Формат ввода  输入格式
// Одно целое число  一个整数

// Формат вывода  输出格式
// Строка: YES, если число делится на три NO, иначе.
// 字符串：如果数能被 3 整除则显示 YES ，否则显示 NO 。

// https://github.com/buonfu/programming101.git


#include <stdio.h>

int main() 
{
    int n;
    scanf("%d", &n);

    if (n % 3 == 0) {
        printf("YES");
    } else {
        printf("NO");
    }

    return 0;
}
