// Пекарня печет пиццы квадратной и круглой формы. Цена пиццы на квадратный сантиметр поверхности – 1 рубль. Пользователь вводит размер стороны квадратной пиццы и радиус круглой. Сосчитать цену каждой пиццы, сказать пользователю какая пицца больше. Определить, сможет ли квадратная пицца поместиться в коробку из-под круглой и наоборот
// 面包店制作方形和圆形披萨。每平方厘米披萨的价格为 1 卢布。用户输入方形披萨的边长和圆形披萨的半径。计算每块披萨的价格，告诉用户哪块披萨更大。确定方形披萨能否放入圆形披萨的盒子里，反之亦然。

// Формат ввода  输入格式
// Два числа: длина квадратной пиццы, радиус круглой пиццы
// 两个数：正方形披萨的长度，圆形披萨的半径

// Формат вывода  输出格式
// Два числа и три слова в одной строке через пробел:
// 两个数字和三个单词在同一行通过空格分隔：

// Цена квадратной пиццы  方形披萨的价格

// Цена круглой пиццы  圆形披萨的价格

// Сообщение о том, какая пицца больше: Квадратная больше, Круглая больше или Одинаковые
// 关于哪种披萨更大的消息： Квадратная больше ， Круглая больше 或 Одинаковые

// Сообщение о том, поместится ли квадратная пицца в круглую коробку: Да или Нет
// 关于方形披萨能否放入圆形盒子的消息： Да 或 Нет

// Сообщение о том, поместится ли круглая пицца в квадратную коробку: Да или Нет
// 关于圆形披萨能否放入方形盒子的消息： Да 或 Нет

// Примечания  备注
// Положите константу π равной
// 将常数 π 设置为

// const double PI = 3.14159265358979323846;

// Обратите внимание, что круглые пиццы упаковываются в круглые коробки!!!
// 请注意，圆形披萨会放入圆形盒子！！！

// Пример 1
// Ввод 1 1
// Вывод 1.000000 3.141593 Круглая больше Да Нет

// Пример 2
// Ввод 1 2
// Вывод 1.000000 12.566371 Круглая больше Да Нет

// Пример 3
// Ввод 2 1
// Вывод 4.000000 3.141593 Квадратная больше Нет Да
