// Написать программу вычисления сопротивления цепи, состоящей из двух параллельно соединенных резисторов, если известно сопротивление каждого из них
// 编写一个计算由两个并联电阻组成的电路电阻的程序，如果已知每个电阻的电阻值

// Формат ввода  输入格式
// Вводятся два вещественных числа R1 R2 (через пробел): сопротивления резисторов в омах.
// 输入两个实数 R1 R2 （通过空格）：电阻的电阻值，单位为欧姆。

// Формат вывода  输出格式
// Одно вещественное число (c 15 знаками после запятой), равное сопротивлению полученной цепи в омах.
// 一个实数（小数点后 15 位），等于所得电路的电阻值，单位为欧姆。
// https://github.com/buonfu/programming101.git


#include <stdio.h>

int main()
{
    double r1, r2;
    double rt;

    scanf("%lf %lf", &r1, &r2);

    rt = 1.0 / (1.0 / r1 + 1.0 / r2);

    printf("%.15f", rt);

    return 0;
}


// #include <stdio.h> 

// int main() 
// {   double r1, r2; 
//     double rt; 
    
//     scanf("%lf %lf", &r1, &r2); 
    
//     rt = (r1 * r2) / (r1 + r2); 
    
//     printf("%.15f", rt); 
    
//     return 0; 
// }

// Terminal 输出为 1000 100 90.909090909090907 
// 考试系统给出的标准答案是 90.909090909090921