/*
    Написать программу пересчета величины временного интервала, заданного в минутах, в величину, выраженную в часах и минутах.
    编写一个程序，将用分钟表示的时间间隔转换为用小时和分钟表示的量。

    Формат ввода  输入格式
    Вводится одно целое число.
    输入一个整数。

    Формат вывода  输出格式
    Два целых числа, разделённых пробелом: число часов, потом число минут.
    两个用空格分隔的整数：小时数，然后是分钟数。
    https://github.com/buonfu/programming101.git
*/

#include <stdio.h>

int main()
{
    int m;
    int h, mr;

//  printf("Please enter the time interval in minutes: ");
    scanf("%d", &m);

    mr = m % 60;
    h = m / 60;

    printf("%d %d", h, mr);

    return 0;
}