// Написать программу вычисления стоимости разговора по телефону с учетом 20% скидки, предоставляемой по субботам и воскресеньям. Исходными данными для программы являются номер дня недели и длительность разговора.
// 编写一个计算电话通话费用的程序，考虑到周六和周日提供的 20% 折扣。程序的数据来源是星期几的编号和通话时长。

// Формат ввода  输入格式
// Номер дня недели: 1 - воскресенье, 2 - понедельник...
// 星期几的编号：1 - 星期日，2 - 星期一...

// длительность разговора в минутах
// 通话时长（分钟）

// стоимость одной минуты разговора
// 每分钟通话费用

// Формат вывода  输出格式
// Одно число: стоимость разговора или строчка Неверный формат ввода, если введённое число, соответствующее номеру дня лежит не в отрезке [1,7].
// 一个数字：通话费用或一行 Неверный формат ввода ，如果输入的数字与天数对应的数字不在 [1,7] 的区间内。

// https://github.com/buonfu/programming101.git


#include <stdio.h>

int main() 
{
    int day;          
    double min;      
    double cpm; 
    double total;
    int rm;

    scanf("%d %lf %lf", &day, &min, &cpm);

    if (day < 1 || day > 7) {
        printf("Неверный формат ввода");
        return 0;
    }

    rm = (int)min;

    if (min > rm) {
        rm++;
    }

    total = rm * cpm;

    
    if (day == 1 || day == 7) {
        total = total * 0.8;  
    }

    printf("%.6f", total);  

    return 0;
}





// #include <stdio.h>

// int main() 
// {
//     int day;          
//     double minutes;      
//     double cpm; 
//     double total;

//     scanf("%d %lf %lf", &day, &minutes, &cpm);

//     if (day < 1 || day > 7) {
//         printf("Неверный формат ввода");
//         return 0;
//     }

//     if (((minutes * 10) % 10) != 0) {
//        minutes = (int)(minutes * 10) / 10;
//        minutes++;
//     }

//     total = minutes * cpm;

    
//     if (day == 1 || day == 7) {
//         total = total * 0.8;  
//     }

//     printf("%.6f", total);  

//     return 0;
// }
