// Написать программу вычисления стоимости покупки с учетом скидки. Скидка в 3% предоставляется, если сумма покупки больше 500 руб, в 5% — если сумма больше 1000 руб.
// 编写一个计算折扣后购买成本的程序。如果购买金额超过 500 卢布，则提供 3%的折扣；如果金额超过 1000 卢布，则提供 5%的折扣。

// Формат ввода  输入格式
// Две целых числа через пробел: число рублей и копеек (< 100) (стоимость покупки)
// 两个整数通过空格：卢布和戈比（<100）（购买价格）

// Формат вывода  输出格式
// Две целых числа через пробел: число рублей и копеек (< 100) (стоимость покупки с учётом скидки).
// 两个整数通过空格：卢布和戈比（<100）（打折后的购买价格）。

// https://github.com/buonfu/programming101.git



#include <stdio.h>

int main() 
{   int rub, kop;
    int total;

    scanf("%d %d", &rub, &kop);

    total = rub * 100 + kop;  

    if (total <= 500 * 100) {
        printf("%d %d", rub, kop);
        return 0;
    }   
    
    if (total > 1000 * 100) {          
        total = total * 95 ;
    }   else if (total > 500 * 100) {    
        total = total * 97 ;
    }

    if ((total % 100) != 0) {
    printf("%d %d", total / 10000, (((total % 10000) + 100) / 100));
    } else {
        printf("%d %d", total / 10000, ((total % 10000)  / 100));
    }

    return 0;
}


// #include <stdio.h>

// int main()
// {
//     int rub, kop;

//     scanf("%d %02d", &rub, &kop);

//     if ((rub == 500 && kop > 00) || (rub > 500 && rub < 1000 ) || (rub == 1000 && kop == 00)) {
//         rub *= 0.97;
//         if ((kop != 0) && ((kop * 97) % 100 != 0)) {
//             kop *= 0.97;
//             kop++;
//         } else {
//             kop *= 0.97;
//         }
//     }  else if ((rub == 1000 && kop > 00) || (rub > 1000)) {
//         rub *= 0.95;
//         if ((kop != 0) && ((kop * 95) % 100 != 0)) {
//             kop *= 0.95;
//             kop++;
//         } else {
//             kop *= 0.95;
//         }
//     }


//     printf("%d %d", rub, kop);

//     return 0;
// }